code/aws/artillery-yaml/tst-003-poll.yaml
config:
  target: 'https://by1ryzegab.execute-api.eu-west-1.amazonaws.com/default'
  phases:
    - duration: 60
      name: 'ramp phase'
      arrivalRate: 20
      rampTo: 100
    - duration: 420
      name: 'test phase'
      arrivalRate: 100
  defaults:
    headers:
      Content-Type: 'application/json'
scenarios:
  - flow:
    - post:
        url: "/sqs-receive-pull"