code/aws/artillery-yaml/tst-003.yaml
config:
  target: 'https://mdb57y2pl1.execute-api.eu-west-1.amazonaws.com/default'
  phases:
    - duration: 60
      name: 'ramp phase'
      arrivalRate: 50
      rampTo: 100
    - duration: 300
      name: 'test phase'
      arrivalRate: 100
  defaults:
    headers:
      Content-Type: 'application/json'
scenarios:
  - flow:
    - post:
        url: "/sqs-send"