code/aws/artillery-yaml/tst-004.yaml
config:
  target: 'https://rmqbr3eyt9.execute-api.eu-west-1.amazonaws.com/default'
  phases:
    - duration: 60
      name: 'ramp phase'
      arrivalRate: 10
      rampTo: 20
    - duration: 300
      name: 'test phase'
      arrivalRate: 20
  defaults:
    headers:
      Content-Type: 'application/json'
scenarios:
  - flow:
    - post:
        url: "/sns-send-ordered"